garyPenhook/PIC-Assembler/device_includes/pic16f17174.inc
// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 0A15h
// bitfield definitions
PWM4CON_ERSNOW_POSN                      equ 0000h
PWM4CON_ERSNOW_POSITION                  equ 0000h
PWM4CON_ERSNOW_SIZE                      equ 0001h
PWM4CON_ERSNOW_LENGTH                    equ 0001h
PWM4CON_ERSNOW_MASK                      equ 0001h
PWM4CON_ERSPOL_POSN                      equ 0001h
PWM4CON_ERSPOL_POSITION                  equ 0001h
PWM4CON_ERSPOL_SIZE                      equ 0001h
PWM4CON_ERSPOL_LENGTH                    equ 0001h
PWM4CON_ERSPOL_MASK                      equ 0002h
PWM4CON_LD_POSN                          equ 0002h
PWM4CON_LD_POSITION                      equ 0002h
PWM4CON_LD_SIZE                          equ 0001h
PWM4CON_LD_LENGTH                        equ 0001h
PWM4CON_LD_MASK                          equ 0004h
PWM4CON_EN_POSN                          equ 0007h
PWM4CON_EN_POSITION                      equ 0007h
PWM4CON_EN_SIZE                          equ 0001h
PWM4CON_EN_LENGTH                        equ 0001h
PWM4CON_EN_MASK                          equ 0080h

// Register: PWM4S1CFG
#define PWM4S1CFG PWM4S1CFG
PWM4S1CFG                                equ 0A16h
// bitfield definitions
PWM4S1CFG_MODE_POSN                      equ 0000h
PWM4S1CFG_MODE_POSITION                  equ 0000h
PWM4S1CFG_MODE_SIZE                      equ 0003h
PWM4S1CFG_MODE_LENGTH                    equ 0003h
PWM4S1CFG_MODE_MASK                      equ 0007h
PWM4S1CFG_PPEN_POSN                      equ 0003h
PWM4S1CFG_PPEN_POSITION                  equ 0003h
PWM4S1CFG_PPEN_SIZE                      equ 0001h
PWM4S1CFG_PPEN_LENGTH                    equ 0001h
PWM4S1CFG_PPEN_MASK                      equ 0008h
PWM4S1CFG_POL1_POSN                      equ 0006h
PWM4S1CFG_POL1_POSITION                  equ 0006h
PWM4S1CFG_POL1_SIZE                      equ 0001h
PWM4S1CFG_POL1_LENGTH                    equ 0001h
PWM4S1CFG_POL1_MASK                      equ 0040h
PWM4S1CFG_POL2_POSN                      equ 0007h
PWM4S1CFG_POL2_POSITION                  equ 0007h
PWM4S1CFG_POL2_SIZE                      equ 0001h
PWM4S1CFG_POL2_LENGTH                    equ 0001h
PWM4S1CFG_POL2_MASK                      equ 0080h
PWM4S1CFG_MODE0_POSN                     equ 0000h
PWM4S1CFG_MODE0_POSITION                 equ 0000h
PWM4S1CFG_MODE0_SIZE                     equ 0001h
PWM4S1CFG_MODE0_LENGTH                   equ 0001h
PWM4S1CFG_MODE0_MASK                     equ 0001h
PWM4S1CFG_MODE1_POSN                     equ 0001h
PWM4S1CFG_MODE1_POSITION                 equ 0001h
PWM4S1CFG_MODE1_SIZE                     equ 0001h
PWM4S1CFG_MODE1_LENGTH                   equ 0001h
PWM4S1CFG_MODE1_MASK                     equ 0002h
PWM4S1CFG_MODE2_POSN                     equ 0002h
PWM4S1CFG_MODE2_POSITION                 equ 0002h
PWM4S1CFG_MODE2_SIZE                     equ 0001h
PWM4S1CFG_MODE2_LENGTH                   equ 0001h
PWM4S1CFG_MODE2_MASK                     equ 0004h

// Register: PWM4S1P1L
#define PWM4S1P1L PWM4S1P1L
PWM4S1P1L                                equ 0A17h
// bitfield definitions
PWM4S1P1L_P1L_POSN                       equ 0000h
PWM4S1P1L_P1L_POSITION                   equ 0000h
PWM4S1P1L_P1L_SIZE                       equ 0008h
PWM4S1P1L_P1L_LENGTH                     equ 0008h
PWM4S1P1L_P1L_MASK                       equ 00FFh
PWM4S1P1L_S1P1L_POSN                     equ 0000h
PWM4S1P1L_S1P1L_POSITION                 equ 0000h
PWM4S1P1L_S1P1L_SIZE                     equ 0008h
PWM4S1P1L_S1P1L_LENGTH                   equ 0008h
PWM4S1P1L_S1P1L_MASK                     equ 00FFh

// Register: PWM4S1P1H
#define PWM4S1P1H PWM4S1P1H
PWM4S1P1H                                equ 0A18h
// bitfield definitions
PWM4S1P1H_P1H_POSN                       equ 0000h
PWM4S1P1H_P1H_POSITION                   equ 0000h
PWM4S1P1H_P1H_SIZE                       equ 0008h
PWM4S1P1H_P1H_LENGTH                     equ 0008h
PWM4S1P1H_P1H_MASK                       equ 00FFh
PWM4S1P1H_S1P1H_POSN                     equ 0000h
PWM4S1P1H_S1P1H_POSITION                 equ 0000h
PWM4S1P1H_S1P1H_SIZE                     equ 0008h
PWM4S1P1H_S1P1H_LENGTH                   equ 0008h
PWM4S1P1H_S1P1H_MASK                     equ 00FFh

// Register: PWM4S1P2L
#define PWM4S1P2L PWM4S1P2L
PWM4S1P2L                                equ 0A19h
// bitfield definitions
PWM4S1P2L_P2L_POSN                       equ 0000h
PWM4S1P2L_P2L_POSITION                   equ 0000h
PWM4S1P2L_P2L_SIZE                       equ 0008h
PWM4S1P2L_P2L_LENGTH                     equ 0008h
PWM4S1P2L_P2L_MASK                       equ 00FFh
PWM4S1P2L_S1P2L_POSN                     equ 0000h
PWM4S1P2L_S1P2L_POSITION                 equ 0000h
PWM4S1P2L_S1P2L_SIZE                     equ 0008h
PWM4S1P2L_S1P2L_LENGTH                   equ 0008h
PWM4S1P2L_S1P2L_MASK                     equ 00FFh

// Register: PWM4S1P2H
#define PWM4S1P2H PWM4S1P2H
PWM4S1P2H                                equ 0A1Ah
// bitfield definitions
PWM4S1P2H_P2H_POSN                       equ 0000h
PWM4S1P2H_P2H_POSITION                   equ 0000h
PWM4S1P2H_P2H_SIZE                       equ 0008h
PWM4S1P2H_P2H_LENGTH                     equ 0008h
PWM4S1P2H_P2H_MASK                       equ 00FFh
PWM4S1P2H_S1P2H_POSN                     equ 0000h
PWM4S1P2H_S1P2H_POSITION                 equ 0000h
PWM4S1P2H_S1P2H_SIZE                     equ 0008h
PWM4S1P2H_S1P2H_LENGTH                   equ 0008h
PWM4S1P2H_S1P2H_MASK                     equ 00FFh

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 01C8Ch
// bitfield definitions
NVMADRL_NVMADR_POSN                      equ 0000h
NVMADRL_NVMADR_POSITION                  equ 0000h
NVMADRL_NVMADR_SIZE                      equ 0008h
NVMADRL_NVMADR_LENGTH                    equ 0008h
NVMADRL_NVMADR_MASK                      equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h

